mledimna/STM32-MySQL/STM32_MySQL.cpp
/*
 * Copyright (c) 2015, 2016, 2020
 * Ivan P. Ucherdzhiev  <ivanucherdjiev@gmail.com> (Initial Autor)
 * Mathieu Le Dimna <mathieu-ledimna@outlook.com> (Co-Author)
 * All Rights Reserved
 */
 
 /*This program is free software: you can redistribute it and/or modify
    it under the terms of the GNU General Public License as published by
    the Free Software Foundation, either version 3 of the License, or
    (at your option) any later version.

    This program is distributed in the hope that it will be useful,
    but WITHOUT ANY WARRANTY; without even the implied warranty of
    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
    GNU General Public License for more details.

    You should have received a copy of the GNU General Public License
    along with this program.  If not, see <http://www.gnu.org/licenses/>.*/

#include "mbed.h"
#include "STM32_MySQL.h"
#include "sha1.h"
#include "EthernetInterface.h"

#define MAX_CONNECT_ATTEMPTS    3
#define MAX_TIMEOUT             10
#define MIN_BYTES_NETWORK       8
#define RECV_SIZE               50000

MySQL::MySQL(TCPSocket* sock):tcp_socket(sock){
}

/**
 * mysql_connect - Connect to MYSQL server
 *
 * This method make TCP connection with the MYSQL server and then 
 * make a handshake with the MYSQL database.
 *
 *
 * user       - pointer to the string with the user name
 * password       - pointer to the string with the password name
 *
 */
int MySQL::connect(char* user, char* password){
    int i = -1;
    unsigned int count = 0;
    int ret=0;
    
    if (tcp_socket!=NULL) {
        read_packet();
        parse_handshake_packet();
        ret = send_authentication_packet(user, password);
        free(server_version);
        return ret;
    }

    return 0;
}

/**
 * Disconnect from the server.
 *
 * Terminates connection with the server. You must call mysql_connect()
 * to reconnect.
*/
void MySQL::disconnect()
{
	//tcp_echoclient_connection_close(); // Add here you function to close the connection with the server
}

/**
 * cmd_query - Execute a SQL statement
 *
 * This method executes the query specified as a character array that is
 * located in data memory. It copies the query to the local buffer then
 * calls the run_query() method to execute the query.
 *
 *
 *
 * query[in]       SQL statement (using normal memory access)
 *
 * Returns boolean - True = a result set is available for reading
*/
int MySQL::cmd_query(const char *query){
    int i, g = 4;
    int query_len = strlen(query);

    if (buffer != NULL) free(buffer);
    buffer = (unsigned char*)malloc(query_len+5);

    memcpy(buffer, "\0", query_len + 5);
    memcpy(&buffer[5], query, query_len);// Write query to packet

    return run_query(query_len);// Send the query
}

/**
 * clear_ok_packet - clear last Ok packet (if present)
 *
 * This method reads the header and status to see if this is an Ok packet.
 * If it is, it reads the packet and discards it. This is useful for
 * processing result sets from stored procedures.
 *
 * Returns False if the packet was not an Ok packet.
*/
int MySQL::clear_ok_packet() {
  int num = 0;

  do {
   // num = client.available();
	  num = 1;
    if (num > 0) {

      //wait_for_client();
      read_packet();
      if (check_ok_packet() != 0) {
        //parse_error_packet();
        return 0;
      }
    }
  } while (num > 0);
  return 1;
}

/**
 * free_columns_buffer - Free memory allocated for column names
 *
 * This method frees the memory allocated during the get_columns()
 * method.
 *
 * NOTICE: Failing to call this method after calling get_columns()
 *         and consuming the column names, types, etc. will result
 *         in a memory leak. The size of the leak will depend on
 *         the size of the combined column names (bytes).
*/
void MySQL::free_columns_buffer() {
	int f;
	// clear the db name and table name
	if(columns.db!=NULL) free(columns.db);
	if(columns.table!=NULL) free(columns.table);
	columns.db = NULL;
	columns.table = NULL;
  // clear the columns and data
  for (int f = 0; f < MAX_FIELDS; f++) {
    if (columns.fields[f] != NULL) {
    	free(columns.fields[f]->name);
    	free(columns.fields[f]);
    }
    columns.fields[f] = NULL;
  }
  num_cols = 0;
  columns_read = 0;
}
/**
 * get_columns - Get a list of the columns (fields)
 *
 * This method returns an instance of the column_names structure
 * that contains an array of fields.
 *
 * Note: you should call free_columns_buffer() after consuming
 *       the field data to free memory.
*/
column_names* MySQL::get_columns() {
	char name[30];
	int i = 0;
  free_columns_buffer();
  num_cols = 0;
  if (get_fields()) {
    columns_read = 1;
    return &columns;
  }
  else {
    return NULL;
  }
}

// Begin private methods

/**
 * run_query - execute a query
 *
 * This method sends the query string to the server and waits for a
 * response. If the result is a result set, it returns true, if it is
 * an error, it processes the error packet. If it is an Ok packet, it parses the packet and
 * returns false.
 *
 * query_len[in]   Number of bytes in the query string
 *
 * Returns boolean - true = result set available,
 *                   false = no result set returned.
*/
int MySQL::run_query(int query_len){
    unsigned int count = 0;

    //Set the first 3 bytes of the packet as the payload length (int<3>)
    store_int(buffer, query_len+1, 3);
    
    buffer[3] = 0x00;//Sequence ID to 0 (Initiator)
    buffer[4] = 0x03;//0x03 : command packet

    //Send the query
    mysql_write((char*)buffer,query_len + 5);

    read_packet();//Read a response packet and stores it into buffer

    int res = check_ok_packet();//Check if it's an ok packet

    if ((res==ERROR_PACKET)||(pack_len<=0)) return 0;//Return 0 if not valid
    
    columns_read = 0;//Not an Ok packet, so we now have the result set to process.
    return 1;
}

bool MySQL::recieve(void){
    int data_recieved_length = 0; //Packet Length
    uint8_t* data_recieved = NULL; //Used to store recieved MySQL server response

    int packets_count = 0;
    uint8_t** packets_received = NULL;
    uint8_t data = 0x00; //Buffer for recieved data
    nsapi_size_or_error_t ret = 0; //Socket return type to check if there was something to read or if an error occured

    //To avoid blocking the thread, set the recieve timeout to 1000ms
    tcp_socket->set_timeout(1000);

    //While there is something to read from the socket we execute the following algorithm
    while(ret>=0){
        //Store recieved data
        ret = tcp_socket->recv(&data, 1);
        
