mledimna/STM32-MySQL/STM32_MySQL.cpp
        //If there was something to read
        if(ret>=0){
            data_recieved_length++;

            //If it's the first byte, use malloc, else use realloc for length-variable table
            if(data_recieved_length==0) data_recieved = (uint8_t*)malloc(sizeof(uint8_t));
            else data_recieved = (uint8_t*)realloc(data_recieved, sizeof(uint8_t)*data_recieved_length);

            //If malloc or realloc worked, append the recieved data to the last allocated index
            //Else return erro to user
            if(data_recieved!=NULL) data_recieved[data_recieved_length-1] = data;
            else{
                printf("Memory allocation error...\r\n");
                return false;
            }
        }
    }

    //If there was nothing to read, return an error to the user
    if(data_recieved_length==0) return false;

    int payload_len = 0;

    for(int offset=0; offset<data_recieved_length; offset+=4+payload_len){
        
        packets_count++;
        payload_len = this->readInt(data_recieved, offset, 3);

        if(offset==0)packets_received = (uint8_t**)malloc(sizeof(uint8_t*));
        else packets_received = (uint8_t**)realloc(packets_received,sizeof(uint8_t*)*packets_count);

        if(packets_received!=NULL) packets_received[packets_count-1] = (uint8_t*)malloc(sizeof(uint8_t)*(payload_len+4));
        else {
            printf("Memory allocation error...\r\n");
            return false;
        }

        for(int i=0; i<payload_len+4; i++) packets_received[packets_count-1][i] = data_recieved[offset+i];
    }

    //To avoid opening another thread on https://stackoverflow.com/
    free(data_recieved);

    printf("Packet(s) received : %d\r\n",packets_count);

    for(int i=0; i<packets_count; i++){
        payload_len = this->readInt(packets_received[i], 0, 3);
        printf("Packent n°%d (len = %d, Type = 0x%X) : \r\n",i,payload_len+4,this->identifyPacket(packets_received[i],payload_len+4));
        for(int j=0; j<payload_len+4; j++) printf("%X ",packets_received[i][j]);
        printf("\r\n");
    }

    //To avoid opening another thread on https://stackoverflow.com/
    for(int i=0; i<packets_count; i++) free(packets_received[i]);
    free(packets_received);

    //No error, something available
    return true;
}

int MySQL::readInt(uint8_t * packet, int offset, int size) {
  int value = 0;

  for(int i=0; i<size; i++) value |= packet[i+offset]<<(i*8);

  return value;
}

Packet_Type MySQL::identifyPacket(uint8_t* packet, int packet_length){
    Packet_Type type = PACKET_UNKNOWN;

    if(packet_length>0){
        switch(packet[4]){
            case 0x00:
                type = PACKET_OK;
            break;

            case 0xFF:
                type = PACKET_ERR;
            break;

            case 0xFE:
                type = PACKET_EOF;
            break;

            default:
            break;
        }
    }

    return type;
}

int MySQL::query(const char *pQuery){
    char * packet = NULL;
    int packet_len = 0;
    int payload_len = 0;
    int ret = 0;

    /*
    COM_QUERY : 
        The SQL packet length is :
            -4 bytes : Header (Payload length<3> + Sequence ID<1>)
            -1 byte : 0x03 (COM_QUERY Flag<1>)
            -n byte(s) : Query length<n>
    */

    payload_len = strlen(pQuery)+1; //Query length + COM_QUERY Flag
    packet_len = payload_len+4; //Header + Payload length

    packet = (char*)malloc(packet_len); //Allocate memory for the packet

    store_int((uint8_t*)packet, payload_len, 3);

    packet[3] = 0x00; //Sequence ID : Initiator
    packet[4] = 0x03; //Set flag to COM_QUERY
    for(int i=0; i<strlen(pQuery); i++) packet[i+5] = pQuery[i]; //Insert query into packet

    printf("\r\n");
    for(int i=0; i<packet_len; i++) printf("%c ",packet[i]);
    printf("\r\n");
    
    ret = mysql_write(packet,packet_len);

    free(packet);

    return ret;
}

/**
 * send_authentication_packet - Send the response to the server's challenge
 *
 * This method builds a response packet used to respond to the server's
 * challenge packet (called the handshake packet). It includes the user
 * name and password scrambled using the SHA1 seed from the handshake
 * packet. It also sets the character set (default is 8 which you can
 * change to meet your needs).
 *
 * Note: you can also set the default database in this packet. See
 *       the code before for a comment on where this happens.
 *
 * The authentication packet is defined as follows.
 *
 * Bytes                        Name
 * -----                        ----
 * 4                            client_flags
 * 4                            max_packet_size
 * 1                            charset_number
 * 23                           (filler) al definedways 0x00...
 * n (Null-Terminated String)   user
 * n (Length Coded Binary)      scramble_buff (1 + x bytes)
 * n (Null-Terminated String)   databasename (optional
 *
 * user[in]        User name
 * password[in]    password
*/
int MySQL::send_authentication_packet(char *user, char *password)
{
	int status = 0;

	int i = 0;
	int len = 0;
	//unsigned char test[256];
	uint8_t *scramble;
	int p_size;
	int size_send = 4;

  if (buffer != NULL)
	  free(buffer);

  buffer = (unsigned char*)malloc(256);
  for (int i = 0 ; i<256; i++)
  {
	  buffer[i] = 0;
  }

  // client flags
  buffer[size_send] = 0x85;
  buffer[size_send+1] = 0xa6;
  buffer[size_send+2] = 0x03;
  buffer[size_send+3] = 0x00;
  size_send += 4;

  // max_allowed_packet
  buffer[size_send] = 0;
  buffer[size_send+1] = 0;
  buffer[size_send+2] = 0;
  buffer[size_send+3] = 1;
  size_send += 4;

  // charset - default is 8
  buffer[size_send] = 0x08;
  size_send += 1;
  for( i = 0; i < 24; i++)
    buffer[size_send+i] = 0x00;
  size_send += 23;

  // user name
  memcpy(&buffer[size_send], user, strlen(user));
  size_send += strlen(user) + 1;
  buffer[size_send-1] = 0x00;

  // password - see scramble password
  scramble = (uint8_t*)malloc(20);
  if (scramble_password(password, scramble)) {
    buffer[size_send] = 0x14;
    size_send += 1;
    for (int i = 0; i < 20; i++)
      buffer[i+size_send] = scramble[i];
    size_send += 20;
    buffer[size_send] = 0x00;
  }
  free(scramble);

  // terminate password response
  buffer[size_send] = 0x00;
  size_send += 1;

