mledimna/STM32-MySQL/STM32_MySQL.cpp
  // database
  buffer[size_send+1] = 0x00;
  size_send += 1;

  // Write packet size
  p_size = size_send - 4;
  store_int(&buffer[0], p_size, 3);
  buffer[3] = 0x01;
  len = strlen((char*)buffer);

  status = mysql_write((char*)buffer,size_send);
  read_packet();//To flush TCP socket
  return status;
}


/**
 * scramble_password - Build a SHA1 scramble of the user password
 *
 * This method uses the password hash seed sent from the server to
 * form a SHA1 hash of the password. This is used to send back to
 * the server to complete the challenge and response step in the
 * authentication handshake.
 *
 * password[in]    User's password in clear text
 * pwd_hash[in]    Seed from the server
 *
 * Returns boolean - True = scramble succeeded
*/
int MySQL::scramble_password(char *password, uint8_t *pwd_hash) {
	SHA1Context sha;
  int i = 0;
  int word = 0, shift = 24, count = 3;
  uint8_t hash1[20];
  uint8_t hash2[20];
  uint8_t hash3[20];
  uint8_t pwd_buffer[40];

  if (strlen(password) == 0)
    return 0;

  // hash1
  SHA1Reset(&sha);
  SHA1Input(&sha, (const unsigned char *) password, strlen(password));
  SHA1Result(&sha);
  for(int i = 0; i<20 ; i++)
  {
	hash1[i] = (sha.Message_Digest[word] >> shift);
  	shift = shift - 8;
  	if(i==count)
  	{
  		shift = 24;
  		word++;
  		count +=4;
  	}

  }
  word = 0;
  shift = 24;
  count = 3;

  // hash2
  SHA1Reset(&sha);
  SHA1Input(&sha, (const unsigned char *) hash1, 20);
  SHA1Result(&sha);
  for (int i = 0; i<20 ; i++)
    {
	  hash2[i] = (sha.Message_Digest[word] >> shift);
    	shift = shift - 8;
    	if(i==count)
    	{
    		shift = 24;
    		word++;
    		count +=4;
    	}

    }
  word = 0;
  shift = 24;
  count = 3;

  // hash3 of seed + hash2
  SHA1Reset(&sha);
  memcpy(pwd_buffer, &seed, 20);
  memcpy(pwd_buffer+20, hash2, 20);
  SHA1Input(&sha, (const unsigned char *) pwd_buffer, 40);
  SHA1Result(&sha);
  for (int i = 0; i<20 ; i++)
      {
	  hash3[i] = (sha.Message_Digest[word] >> shift);
      	shift = shift - 8;
      	if(i==count)
      	{
      		shift = 24;
      		word++;
      		count +=4;
      	}

      }
  word = 0;
  shift = 24;
  count = 3;

  // XOR for hash4
  for (int i = 0; i < 20; i++)
    pwd_hash[i] = hash1[i] ^ hash3[i];

  return 1;
}


/**
 * read_packet - Read a packet from the server and store it in the buffer
 *
 * This method reads the bytes sent by the server as a packet. All packets
 * have a packet header defined as follows.
 *
 * Bytes                 Name
 * -----                 ----
 * 3                     Packet Length
 * 1                     Packet Number
 *
 * Thus, the length of the packet (not including the packet header) can
 * be found by reading the first 4 bytes from the server then reading
 * N bytes for the packet payload.
*/
void MySQL::read_packet() {
  uint8_t local[4];
  int i = 0;

  if (buffer != NULL) {
      free(buffer);
      buffer = NULL;
  }
    data_rec = (uint8_t*)malloc(RECV_SIZE);
    pack_len = tcp_socket->recv(data_rec, RECV_SIZE);

    packet_len = pack_len - 4;

  // Check for valid packet.
  if (packet_len < 0) packet_len = 0;

  buffer = (unsigned char*)malloc(packet_len+4);
  
  if (buffer == NULL) return;

  for (int i = 0; i < 4; i++) buffer[i] = local[i];
  for (int i = 4; i < packet_len+4; i++) buffer[i] = data_rec[i];

  memset( data_rec, '\0', sizeof(*data_rec) );
  free(data_rec);

  data_rec = NULL;
}

void MySQL::read_packet_limit() {
  uint8_t local[4];
  int i = 0;

  if (buffer != NULL)
  {
	  memset( buffer, '\0', sizeof(*buffer) );
	  free(buffer);
	  buffer = NULL;
  }

  packet_len = pack_len-4;

  // Check for valid packet.
  if (packet_len < 0) packet_len = 0;
  buffer = (unsigned char*)malloc(packet_len+4);
  
  if (buffer == NULL) return;

  for (int i = 0; i < 4; i++) buffer[i] = local[i];
  for (int i = 4; i < packet_len+4; i++) buffer[i] = data_rec[i];

  memset( data_rec, '\0', sizeof(*data_rec) );
  free(data_rec);
  data_rec = NULL;
}

/**
 * parse_handshake_packet - Decipher the server's challenge data
 *
 * This method reads the server version string and the seed from the
 * server. The handshake packet is defined as follows.
 *
 *  Bytes                        Name
 *  -----                        ----
 *  1                            protocol_version
 *  n (Null-Terminated String)   server_version
 *  4                            thread_id
 *  8                            scramble_buff
 *  1                            (filler) always 0x00
 *  2                            server_capabilities
 *  1                            server_language
 *  2                            server_status
 *  2                            server capabilities (two upper bytes)
 *  1                            length of the scramble seed
 * 10                            (filler)  always 0
 *  n                            rest of the plugin provided data
 *                               (at least 12 bytes)
 *  1                            \0 byte, terminating the second part of
 *                                a scramble seed
*/
void MySQL::parse_handshake_packet() {

	int j = 0;
  int i = 5;
  do {
    i++;
  } while (buffer[i-1] != 0x00);

  server_version = (char*)malloc(i-5);
  strncpy(server_version, (char *)&buffer[5], i-5);

  // Capture the first 8 characters of seed
  i += 4; // Skip thread id
  for (int j = 0; j < 8; j++)
    seed[j] = buffer[i+j];

  // Capture rest of seed
  i += 27; // skip ahead
  for (int j = 0; j < 12; j++)
    seed[j+8] = buffer[i+j];
}

/**
 * check_ok_packet - Decipher an Ok packet from the server.
 *
 * This method attempts to parse an Ok packet. If the packet is not an
 * Ok, packet, it returns the packet type.
 *
 *  Bytes                       Name
 *  -----                       ----
 *  1   (Length Coded Binary)   field_count, always = 0
 *  1-9 (Length Coded Binary)   affected_rows
 *  1-9 (Length Coded Binary)   insert_id
 *  2                           server_status
 *  2                           warning_count
 *  n   (until end of packet)   message
 *
 * Returns integer - 0 = successful parse, packet type if not an Ok packet
*/
int MySQL::check_ok_packet() {
  int type = buffer[4];
  if (type != OK_PACKET)
    return type;
  return 0;
}


/**
 * get_lcb_len - Retrieves the length of a length coded binary value
 *
 * This reads the first byte from the offset into the buffer and returns
 * the number of bytes (size) that the integer consumes. It is used in
 * conjunction with read_int() to read length coded binary integers
 * from the buffer.
 *
 * Returns integer - number of bytes integer consumes
*/
int MySQL::get_lcb_len(int offset) {
  int read_len = buffer[offset];
  if (read_len > 250) {
    // read type:
	uint8_t type = buffer[offset+1];
    if (type == 0xfc)
      read_len = 2;
    else if (type == 0xfd)
      read_len = 3;
    else if (type == 0xfe)
      read_len = 8;
  }
  return read_len;
}

/**
 * read_string - Retrieve a string from the buffer
 *
 * This reads a string from the buffer. It reads the length of the string
 * as the first byte.
 *
 * offset[in]      offset from start of buffer
 *
 * Returns string - String from the buffer
*/
char* MySQL::read_string(int *offset){
    int len = get_lcb_len(*offset);
    char *str = NULL;
    char head = buffer[*(offset)];

    if(head==0xFE) return NULL;
    
    str = (char*)malloc(len+1);
    memcpy(str, (char *)&buffer[*offset+1], len);
    str[len] = '\0';

    return str;
}

/**
 * read_int - Retrieve an integer from the buffer in size bytes.
 *
 * This reads an integer from the buffer at offset position indicated for
 * the number of bytes specified (size).
 *
 * offset[in]      offset from start of buffer
 * size[in]        number of bytes to use to store the integer
 *
 * Returns integer - integer from the buffer
*/
int MySQL::read_int(int offset, int size){
  int value = 0;
  int new_size = 0;
  int i;

  if (size == 0) new_size = get_lcb_len(offset);
  if (size == 1) return buffer[offset];

  new_size = size;

