mledimna/STM32-MySQL/STM32_MySQL.cpp
  int shifter = (new_size - 1) * 8;

  for (int i = new_size; i > 0; i--) {
    value += (uint8_t)(buffer[i-1] << shifter);
    shifter -= 8;
  }

  return value;
}


/**
 * store_int - Store an integer value into a byte array of size bytes.
 *
 * This writes an integer into the buffer at the current position of the
 * buffer. It will transform an integer of size to a length coded binary
 * form where 1-3 bytes are used to store the value (set by size).
 *
 * buff[in]        pointer to location in internal buffer where the
 *                 integer will be stored
 * value[in]       integer value to be stored
 * size[in]        number of bytes to use to store the integer
*/
void MySQL::store_int(uint8_t *buff, long value, int size){
    memset(buff, 0, size);
    if (value < 0xff)
        buff[0] = (uint8_t)value;
    else if (value < 0xffff) {
        buff[0] = (uint8_t)value;
        buff[1] = (uint8_t)(value >> 8);
    } else if (value < 0xffffff) {
        buff[0] = (uint8_t)value;
        buff[1] = (uint8_t)(value >> 8);
        buff[2] = (uint8_t)(value >> 16);
    } else if (value < 0xffffff) {
        buff[0] = (uint8_t)value;
        buff[1] = (uint8_t)(value >> 8);
        buff[2] = (uint8_t)(value >> 16);
        buff[3] = (uint8_t)(value >> 24);
    }
}


/**
 * get_fields - reads the fields from the read buffer
 *
 * This method is used to read the field names, types, etc.
 * from the read buffer and store them in the columns structure
 * in the class.
 *
*/
int MySQL::get_fields(){
    int num_fields = 0, f , offset = 13, len_bytes;

    if (buffer == NULL) return 0;

    num_fields = buffer[4];//Column count
    columns.num_fields = num_fields;
    num_cols = num_fields; // Save this for later use


    len_bytes = get_lcb_len(offset);
    columns.db = read_string(&offset);
    // get table
    offset += len_bytes + 1;
    columns.table = read_string(&offset);

    for (int f = 0; f < num_fields; f++) {
        field_struct *field = (field_struct *)malloc(sizeof(field_struct));

        len_bytes = get_lcb_len(offset);
        offset += (len_bytes+ 1) * 2;
        field->name = read_string(&offset);
        len_bytes = get_lcb_len(offset);
        offset += (len_bytes+ 1) * 2;

        if((f+1) != num_fields){
            offset += 21;
            len_bytes = get_lcb_len(offset);
            offset += len_bytes + 1;
        }
        columns.fields[f] = field;
    }
    columns_read = 1;
    get_row_values( &offset);
    return 1;
}


/**
 * get_row_values - reads the row values from the read buffer
 *
 * This method is used to read the row column values
 * from the read buffer and store them in the row structure
 * in the class.
 *
*/
int MySQL::get_row_values( int *off) {
    int res = 0;
    int offset = *off + 26;
    int f;
    int len_bytes;
    // It is an error to try to read rows before columns
    // are read.
    if (!columns_read) {
        return EOF_PACKET;
    }
    for (int f = 0; f < num_cols; f++) {
        if(buffer[offset]!=0xFE){//If packet is not a EOF_Packet
            len_bytes = get_lcb_len(offset);
            columns.fields[f]->data = read_string(&offset);
            offset += len_bytes+ 1;
        }
        else columns.fields[f]->data = NULL;
    }

    return 1;
}


/* Function which send the query by existing tcp socket*/
/* here this function can be modified by your own send function*/
int MySQL::mysql_write(char * message, uint16_t len) {
	return tcp_socket->send((void*)message, len);
}

int MySQL::getBuffer(uint8_t* ext_buffer){
    if(ext_buffer!=NULL) free(ext_buffer);
    ext_buffer = (uint8_t*)malloc(packet_len+4);
    for(int i=0; i<pack_len+4; i++) ext_buffer[i] = buffer[i];

    return ((int)pack_len+4);
}